const intialState = [
  {
    id: "1",
    createdAt: "04-01-2022",
    name: "untitled-document.md",
    content: "",
  },
  {
    id: "2",
    createdAt: "04-01-2022",
    name: "welcome.md",
    content:
      "# مرحباً بك في محرر ماركداون\n\nماركداون هي لغة ترميز بسيطة يمكنك استخدامها لإضافة عناصر التنسيق إلى مستندات النص العادي.\n\n## كيف تستخدم هذا؟\n\n1. اكتب ماركداون في نافذة محرر ماركداون\n2. شاهد النص المنسق في نافذة المعاينة\n\n### المميزات\n\n- إنشاء العناوين والفقرات والروابط والاقتباسات والكود المضمن وكتل الكود والقوائم\n- تسمية وحفظ المستند للوصول إليه لاحقاً\n- اختيار بين الوضع المظلم أو المضيء حسب تفضيلك\n\n> هذا مثال على الاقتباس. إذا كنت ترغب في معرفة المزيد عن صيغة ماركداون، يمكنك زيارة [دليل ماركداون المختصر](https://www.markdownguide.org/cheat-sheet/).\n\n#### العناوين\n\nلإنشاء عنوان، أضف علامة الشباك (#) قبل العنوان. عدد علامات الشباك يجب أن يتوافق مع مستوى العنوان. سترى في هذا الدليل أننا استخدمنا جميع مستويات العناوين الستة (ليس بالضرورة بالطريقة الصحيحة!) لتوضيح كيف يجب أن تبدو.\n\n##### القوائم\n\nيمكنك رؤية أمثلة على القوائم المرتبة وغير المرتبة أعلاه.\n\n###### كتل الكود\n\nيسمح محرر ماركداون هذا بكتابة الكود المضمن، مثل: `<p>أنا نص مضمن</p>`. كما يسمح بكتل الكود الأكبر مثل:\n\n```\n<main>\n  <h1>هذه كتلة كود أكبر</h1>\n</main>\n```",
  },
];

export default intialState;
